run/tutorials/multiphase/interCondEvapPhaseChangeFoam/StefanProblem_zeroGradpInletOutletBCs/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1E-04;

X 36;

vertices        
(
    (0  -1 0)
    ($X -1 0)
    ($X  1 0)
    (0   1 0)
    (0  -1 1)
    ($X -1 1)
    ($X  1 1)
    (0   1 1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (512 1 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
  
   empty  upDown	 
    (
        (3 7 6 2)
	(1 5 4 0)
    )
    patch left 
    (
        (0 4 7 3)
    )
    patch right 
    (
        (2 6 5 1)
    ) 

    empty frontAndBack 
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
