run/tutorials/multiphase/interCondEvapPhaseChangeFoam/StefanProblem_zeroGradpInletOutletBCs/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 3;
        alphaOuterCorrectors yes;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
		maxIter			150;
		maxUnboundedness 1;
		CoCoeff 0.2;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner DIC;
        /*{
            preconditioner  GAMG;
            tolerance       1e-08;
            relTol          0;
            nVcycles        2;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }*/

        tolerance       1e-10;
        relTol          0;
        maxIter         20;
    };

    pcorr
    {
        $p_rgh;
        relTol           0;
    };

    p_rghFinal
     {
        solver          PCG;
        preconditioner  DIC;
        /*{
            preconditioner  GAMG;
            tolerance       1e-08;
            relTol          0;
            nVcycles        2;
            smoother        GaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration false;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }*/
	}

    //pcorr
    //{
    //    solver          PCG;
    //    preconditioner  DIC;
    //    tolerance       1e-5;
    //    relTol          0;
    //}

    //p_rgh
    //{
    //    solver          PCG;
    //    preconditioner  DIC;
    //    tolerance       1e-07;
    //    relTol          0.05;
    //}

    //p_rghFinal
    //{
    //    $p_rgh;
    //    relTol          0;
    //}

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
    UFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
		maxIter			150;
    }
    TFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
		maxIter			150;
    }
    PHIFinal
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
		maxIter			150;
    }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
	pRefCell            0;
	pRefValue           0;

	smoothItr			3;
	kSmoothItr			0;
}

//relaxationFactors
//{
//    fields
//    {
//    }
//    equations
//    {
////        ".*" 1;
//           T 0.9;
//    }
//}


// ************************************************************************* //
